Table of Contents
 Class ResultOnMember
Namespace
IdeaRS.OpenModel.Result
Assembly
IdeaRS.OpenModel.dll
Result of the member
[Obfuscation(Feature = "renaming")]
public class ResultOnMember
Inheritance
object
ResultOnMember
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ResultOnMember()
Constructor
public ResultOnMember()
 ResultOnMember(Member, ResultType)
Constructor
public ResultOnMember(Member member, ResultType resultType)
Parameters
member Member
Member
resultType ResultType
Type of result
Properties
 LocalSystemType
Type of local system of result
public ResultLocalSystemType LocalSystemType { get; set; }
Property Value
ResultLocalSystemType
 Member
Member
public Member Member { get; set; }
Property Value
Member
 ResultType
Type of result
public ResultType ResultType { get; set; }
Property Value
ResultType
 Results
List of result
public List<ResultBase> Results { get; set; }
Property Value
List<ResultBase>
 Edit this page